---
kind: method
id: M:Autodesk.Revit.DB.ElementIntersectsSolidFilter.#ctor(Autodesk.Revit.DB.Solid)
source: html/726f66b7-472e-aa47-d0ea-e45a47094fb3.htm
---
# Autodesk.Revit.DB.ElementIntersectsSolidFilter.#ctor Method

Constructs a filter to match elements which intersect the given element.

## Syntax (C#)
```csharp
public ElementIntersectsSolidFilter(
	Solid solid
)
```

## Parameters
- **solid** (`Autodesk.Revit.DB.Solid`) - The solid geometry to check for intersection.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null